Hello = "\nКруто, давай начнем!\n"

What_else = "\nЧто ещё угодно?\n"

Wrong_command = "\nХмм... Ты хочешь того, что я не знаю." \
                "\nСоберись и попробуй еще\n"

Too_slow = "\nСлишком медленно! Нажми Enter, чтобы продолжить\n"

Prologue = [
    "Добро пожаловать в Дерри!\n\n",
    "Милый городок, гимн которого мог бы начинаться со слов:",
    "\"Здесь живут простые люди, здесь живут мои друзья...\"",
    "Если бы в городе не поселилось...\n",
    "ОНО.\n",
    "Каждые 28 лет оно выходит из ада и "
    "поселяется в канализации этого города...",
    "И сегодня ОНО снова проснулось  и похитило малыша Джорджи.\n",
    "Но брат Джорджи - Билл - не готов мириться с этим.",
    "Он хочет остановить чудовище.",
    "Только он, Заика Билл, красавица Беверли,толстячок Бен и "
    "их друзья способны остановить Пеннивайза...",
    "Но смогут ли они?\n"
]

Ben_definition = "Парень, у которого большая не только душа, но и одежда." \
                 "\nЕсли поделить часы, проведенные " \
                 "им за занятиями спортом, " \
                 "на те, что он провел за книгами \n- получится бесконечно " \
                 "малое число.\nЗато крайне сообразителен и никогда " \
                 "не предаст друзей\n" \
                 "Суперспособность - ум"

Ben_intro_level_one = [
    "Бен как обычно проводил время в библитеке.",
    "Читал \"Историю Дерри\"",
    "Вдруг из хранилища вылетел красный воздушный шар...",
    "Он манил Бена за собой...",
    "И Бен пошел за ним.",
    "Шар вел его между лабиринтами стеллажей...",
    "Бен еле успевал...",
    "Неожиданно, шар исчез.",
    "Бен огляделся. Он заблудился в лабиринте. Ему стало страшно.",
    "Вдруг из-за одного шкафа выглянул... Клоун...",
    "Пенннивайз.",
    "И Бен понял, что пора сматываться"
]

Ben_set = "Хороший выбор. Бен крут, хоть и нескладен\n"

Beverly_definition = "Девушка с огненными волосами, сводящая с ума Билла и " \
                     "Бена.\nВолевая, с сильным характером - " \
                     "вот уж точно кто не боится опасностей\n" \
                     "Суперспособность - воля."

Beverly_intro_level_one = [
    "Беверли зашла в ванную, чтобы умыться после тяжелого дня...",
    "Она наклонилась над раковиной и вдруг...",
    "Из неё послышались голоса...",
    "Детские голоса...",
    "\"Беверли, мы все здесь летаем... Идем к нам... Ты тоже будешь летать\"",
    "\"ТЫ ТОЖЕ БУДЕШЬ ЛЕТАТЬ!",
    "И из раковины мгновенно хлынул поток крови.",
    "Она залила всё: ванная стала равномерно бордового цвета и " 
    "наполинлась запахом стали.",
    "Когда Беверли на секунду отошла от шока и обернулась..."
    "Она увидела за шторкой душевой...",
    "ПЕННИВАЙЗА",
    "и поняла, что пора бежать!"
]

Beverly_set = "Огонь-девушка!!!\n"

Bill_definition = "Вот точно кто хочет свести счеты с чудовищем - так это " \
                  "Билл.\nДа, он прекрасен во всем, но есть нюанс:" \
                  " его решимость и бесстрашие могут подкосить " \
                  "воспоминания о Джоджи...\nЕсть " \
                  "велосипед, поэтому Усейн Болт видит лишь его спину\n" \
                  "Суперспособность - скорость"

Bill_intro_level_one = [
    "Билл поздно вечером возвращался на велосипеде домой.",
    "Его велосипед, Сильвер, как его "
    "называл сам Билл, летел по дорогам Дерри.",
    "Хоть Сильвер был слишком большой для парня, "
    "Билл прекрасно управлялся с ним.",
    "Некоторые машины ездили медленнее...\n",
    "Вдруг краем глаза Билл замечает, что над водой канала имени Дерри...",
    "Летает множество разноцветных шаров.",
    "Точнее, они стоят. Даже ветер не колышет их.",
    "И из воды канала поялвяется мерзкий клоун, "
    "и противным голосом предлагает:",
    "\"Билл, возьми шарик. Ты будешь летать. Джорджи летает, "
    "и вместе с ним БУДЕШЬ ЛЕТАТЬ!\"",
    "Но Билл не потерял самообладание и понял,",
    "Нужно бежать!"
]

Bill_set = "Пеннивайз будет молить о пощаде!\n"

Choose_character_instruction = [
    "\nСейчас настало самое время выбрать пресонажа.",
    "Кем ты хочешь быть, отчаянный герой? Биллом, Беном или,"
    "быть может, Беверли?)",
    "\nВведи \"узнать о \" и имя пресонажа(например, "
    "узнать о Билле), чтобы получить информацию о нем\n",
    "или \"я \" и имя персонажа(например, я Билл), "
    "чтобы оказаться в его шкуре\n"
]

Level_one = "Уровень 1. Погоня"

Wrong_turn = "Ты повернул не туда, -5ХР\n"

Wrong_step = "Ты споткнулся, -5ХР\n"

Level_one_commands = ["Беги", "Поверни налево", "Поверни направо",
                      "Пригнись", "Подпрыгни"]

Level_one_answers = ["беги", "налево", "направо", "вниз", "вверх"]

Choose_character_commands = [
    "узнать о билле",
    "узнать о бене",
    "узнать о беверли",
    "я билл",
    "я бен",
    "я беверли"
]

Your_speed = "Твоя скорость: {}"
Your_health = "Твое здоровье: {}"

Level_one_rules = [
    "Правила просты:\n"
    "На экране будут появляться команды, в соответсвии с которыми "
    "нужно будет ввести слово\n"
    "чтобы скрыться от Пеннивайза. Вот они:",
    "\nБудь внимателен, друг мой.\n"
    "Любая ошибка приблизит к тебе Пеннивайза и отнимет 5ХР "
    "драгоценного здоровья\n"
    "Так же важно вводить команды быстро, иначе Пеннивайз сможет"
    " дотянуться до тебя\n"
    "И ты снова потеряешь 5ХР\n\n"
    "Время, отведенное на ответ, зависит от скорости "
    "твоего персонажа:",
    "Не забывай после ввода ответа нажимать ENTER\n",
    "Если ты чувствуешь в себе силы начать,"
    " мой друг, нажми ENTER и удачи!\n"
]

Level_one_congrats = [
    "Да ты молодец! Пришло время ускориться!",
    "Да ты молодец! Сейчас ты близок к выходу как никода!",
    "Да ты спортсмен, оказывается!\n"
    "Ты успешно скрылся от этого монстра! Посмотрим, что ждёт тебя дальше!"
]

Level_one_restarts = [
    "Оооо нееет!!!\n"
    "Пеннивайз вкусно пообедал. \nА ты попробуй ещё.",
    "Оооо нееет!!!\n Жизнь бывает жестока, как Пенивайз сегодня.\n"
    " А ты попробуй ещё.",
    "Оооо нееет!!!\n Победа была так близко... \n"
    "Сейчас обязательно сможешь!"
]

Skip_level_one = 'Пропустить первый уровень? '

Yes = 'да'

Level_two = 'Уровень 2. Убить убийцу\n'

Level_two_intro = ['Биллу, Бену и Беверли удалось скрыться от Пеннивайза.',
                   'Но десятку других детей Дерри, к сожалению, нет...',
                   'Похищения не прекращались.',
                   'Наоборот, клоун будто взбесился и утаскивал порой троих '
                   'детей за день.\n',
                   'И вы с друзьями решили положить этому конец...',
                   'И УБИТЬ это чудовище!\n',
                   'Проанализировав карту Дерри вы поняли, что ОНО живет в '
                   'канализации.',
                   'А все ее стоки сходятся под Колодезным домиком.',
                   'Набравшись решимости и собрав друзей, вы направились туда',
                   'чтобы раз и навсегда закончить эту историю.\n']

Level_two_rules = ['На эране будут появляться команды.',
                   'Чтобы атаковать чудовище, тебе достаточно в точности, '
                   'без ошибок ввести их (без \"!\")',
                   'Будь внимателен и быстр, друг мой, чтобы ОНО не успело '
                   'атаковать тебя.',
                   'Нажми ENTER, как будешь готов']

Level_two_choose_tool = ['Было бы глупо, мой герой, идти воевать с '
                         'чудовищем без оружия.',
                         'И не менее глупо брать его из дома - ',
                         'Попробуй, объясни маме, зачем тебе огромный '
                         'кухонный тесак или отцовская бензопила.',
                         'Поэтому приходится довольствоватьтся тем, '
                         'что нашлось среди мусора около Колодезного домика.',
                         'Посмотри, что тебе походит и с чем ты готов идти '
                         'на Пеннивайза.\n']

Tool_names = {'Knife': 'Нож', 'Ax': 'Топор', 'Tube': 'Труба'}

Tool_definitions = {'Knife': 'Слабоватое оружие против Пеннивайза.\nГлавный '
                             'его минус - нужно подойти достаточно близко, '
                             'чтобы ранить клоуна\nНо если ты достаточно '
                             'быстр, друг мой, то тебе всё по зубам!\n',
                    'Ax': 'Мощное оружие, способное раскроить черепушку '
                          'клоуна на две части\nвсего за несколько '
                          'ударовю\nНо вот проблема: топор - вещь нелегкая, '
                          'и чтобы успешно орудовать им, тебе нужно быть '
                          'достаточно сильным.\nЕсли Пеннивайз потрепал тебя в'
                          ' погоне - возьми что-нибудь полегче, друг мой\n',
                    'Tube': 'Лёгкая, прочная, способна нанести достаточный '
                            'урон, не прилагая особых усилий.\nЕдиственный '
                            'минус - выглядит не очень устрашающе.\nПоэтому '
                            'нужно быть достаточно смелым, чтобы подойти к '
                            'Пеннивайзу с таким орудием\n'}

Tool_choice_congrats = {'Knife': 'Отличный выбор!\nПочувствуй себя ниндзя!\n',
                        'Ax': 'Супер!\nГулять так гулять - рубить так '
                              'рубить!\n',
                        'Tube': 'Круто!\nВ случае успеха, можно сыграть на '
                                'ней на похоронах клоуна!\n'}

Tool_commands = {'Knife': ['\nРежь', '\nСправа', '\nСлева', '\nСнизу',
                           '\nВ печень', '\nВ сердце'],
                 'Ax': ['\nРуби', '\nКромсай', '\nС размаху', '\nС плеча',
                        '\nС головы'],
                 'Tube': ['\nСправа', '\nСлева', '\nГлуши', '\nТыкай',
                          '\nПо голове', '\nПо спине']}

Tool_wrong_input = 'К сожалению, такого не найти в окрестносях\nКолодезного ' \
                   'домика... Попробуй еще:\n'

Your_tool_choice = 'Что же ты выберешь?\n(чтобы выбрать оружие, достаточно ' \
                   'просто ввести его название и нажать ENTER)\n'

Level_two_congrats = ['Пеннивайз наполовину мертв, чем жив.\nНо это ещё не '
                      'конец\n',
                      'Клоун мёртв!!!']
Level_two_fail = ['Увы, удача была не на твоей стороне... Попробуй ещё',
                  'Печально, печально... Победа была так близка...\n'
                  'Полетай и возвращайся']

Penny_attac_phrases = ['Тебе не справиться со мной!',
                       'Ты тоже будешь летать!',
                       'Сейчас ты отправишься к Джорджи!']

Level_two_too_slow = 'Медленно!'

Press_enter = 'Нажмми ENTER, чтобы продолжить'

Penny_hurt_phrases = ['Так тебе и нужно, Пеннивайз! -{}ХР',
                      'Меткое попадание! -{}ХР',
                      'Возвращайся в ад! -{}ХР']

Broken_tool = 'Оооо, нееет!\nПеннивайз выбил твой {}!' \
              '\nСкорее выбирай другое ' \
              'орудие!\nТебе доступны:'

You_win = ['Билл, Бен и Беверли отправили клоуна вновь в Преисподнюю.',
           'Похищения прекратились. Жизнь в Дерри стала чуточку лучше.',
           'Наши герои закончили школу и разъехались по разным городам '
           'Америки',
           'Их жизнь была достаточно счаслива для среднестатистического '
           'американца.',
           'Пока...\n'
           'Через 28 лет в Дерри вновь не проснулось\n',
           'ОНО.']
