Hello = "\nКруто, давай начнем!\n"

What_else = "\nЧто ещё угодно?\n"

Wrong_command = "\nХмм... Ты хочешь того, что я не знаю." \
                "\nСоберись и попробуй еще\n"

Too_slow = "\nСлишком медленно! Нажми Enter, чтобы продолжить\n"
Prologue = [
    "Добро пожаловать в Дерри!\n\n",
    "Милый городок, гимн которого мог бы начинаться со слов:",
    "\"Здесь живут простые люди, здесь живут мои друзья...\"",
    "Если бы в городе не поселилось...\n",
    "ОНО.\n",
    "Каждые 28 лет оно выходит из ада и "
    "поселяется в канализации этого города...",
    "И сегодня ОНО снова проснулось  и похитило малыша Джорджи.\n",
    "Но брат Джорджи - Билл - не готов мириться с этим.",
    "Он хочет остановить чудовище.",
    "Только он, Заика Билл, красавица Беверли,толстячок Бен и "
    "их друзья способны остановить Пеннивайза...",
    "Но смогут ли они?\n"
]

Ben_definition = "Парень, у которого большая не только душа, но и одежда." \
                 "\nЕсли поделить часы, проведенные " \
                 "им за занятиями спортом, " \
                 "на те, что он провел за книгами \n- получится бесконечно " \
                 "малое число.\nЗато крайне сообразителен и никогда " \
                 "не предаст друзей\n" \
                 "Суперспособность - ум"

Ben_intro_level_one = [
    "Бен как обычно проводил время в библитеке.",
    "Читал \"Историю Дерри\"",
    "Вдруг из хранилища вылетел красный воздушный шар...",
    "Он манил Бена за собой...",
    "И Бен пошел за ним.",
    "Шар вел его между лабиринтами стеллажей...",
    "Бен еле успевал...",
    "Неожиданно, шар исчез.",
    "Бен огляделся. Он заблудился в лабиринте. Ему стало страшно.",
    "Вдруг из-за одного шкафа выглянул... Клоун...",
    "Пенннивайз.",
    "И Бен понял, что пора сматываться"
]

Ben_set = "Хороший выбор. Бен крут, хоть и нескладен\n"

Beverly_definition = "Девушка с огненными волосами, сводящая с ума Билла и " \
                     "Бена.\nВолевая, с сильным характером - " \
                     "вот уж точно кто не боится опасностей\n" \
                     "Суперспособность - воля."

Beverly_intro_level_one = [
    "Беверли зашла в ванную, чтобы умыться после тяжелого дня...",
    "Она наклонилась над раковиной и вдруг...",
    "Из неё послышались голоса...",
    "Детские голоса...",
    "\"Беверли, мы все здесь летаем... Идем к нам... Ты тоже будешь летать\"",
    "\"ТЫ ТОЖЕ БУДЕШЬ ЛЕТАТЬ!",
    "И из раковины мгновенно хлынул поток крови.",
    "Она залила всё: ванная стала равномерно бордового цвета и " 
    "наполинлась запахом стали.",
    "Когда Беверли на секунду отошла от шока и обернулась..."
    "Она увидела за шторкой душевой...",
    "ПЕННИВАЙЗА",
    "и поняла, что пора бежать!"
]

Beverly_set = "Огонь-девушка!!!\n"

Bill_definition = "Вот точно кто хочет свести счеты с чудовищем - так это " \
                  "Билл.\nДа, он прекрасен во всем, но есть нюанс:" \
                  " его решимость и бесстрашие могут подкосить " \
                  "воспоминания о Джоджи...\nЕсть " \
                  "велосипед, поэтому Усейн Болт видит лишь его спину\n" \
                  "Суперспособность - скорость"

Bill_intro_level_one = [
    "Билл поздно вечером возвращался на велосипеде домой.",
    "Его велосипед, Сильвер, как его "
    "называл сам Билл, летел по дорогам Дерри.",
    "Хоть Сильвер был слишком большой для парня, "
    "Билл прекрасно управлялся с ним.",
    "Некоторые машины ездили медленнее...\n",
    "Вдруг краем глаза Билл замечает, что над водой канала имени Дерри...",
    "Летает множество разноцветных шаров.",
    "Точнее, они стоят. Даже ветер не колышет их.",
    "И из воды канала поялвяется мерзкий клоун, "
    "и противным голосом предлагает:",
    "\"Билл, возьми шарик. Ты будешь летать. Джорджи летает, "
    "и вместе с ним БУДЕШЬ ЛЕТАТЬ!\"",
    "Но Билл не потерял самообладание и понял,",
    "Нужно бежать!"
]

Bill_set = "Пеннивайз будет молить о пощаде!\n"

Choose_character_instruction = [
    "\nСейчас настало самое время выбрать пресонажа.",
    "Кем ты хочешь быть, отчаянный герой? Биллом, Беном или,"
    "быть может, Беверли?)",
    "\nВведи \"узнать о \" и имя пресонажа(например, "
    "узнать о Билле), чтобы получить информацию о нем\n",
    "или \"я \" и имя персонажа(например, я Билл), "
    "чтобы оказаться в его шкуре\n"
]

Level_one = "Уровень 1. Погоня"

Wrong_turn = "Ты повернул не туда, -5ХР\n"

Wrong_step = "Ты споткнулся, -5ХР\n"

Level_one_commands = ["Беги", "Поверни налево", "Поверни направо",
                      "Пригнись", "Подпрыгни"]

Level_one_answers = ["беги", "налево", "направо", "вниз", "вверх"]

Choose_character_commands = [
    "узнать о билле",
    "узнать о бене",
    "узнать о беверли",
    "я билл",
    "я бен",
    "я беверли"
]

Your_speed = "Твоя скорость: {}"
Your_health = "Твое здоровье: {}"

Level_one_rules = [
    "Правила просты:\n"
    "На экране будут появляться команды, в соответсвии с которыми "
    "нужно будет ввести слово\n"
    "чтобы скрыться от Пеннивайза. Вот они:",
    "\nБудь внимателен, друг мой.\n"
    "Любая ошибка приблизит к тебе Пеннивайза и отнимет 5ХР "
    "драгоценного здоровья\n"
    "Так же важно вводить команды быстро, иначе Пеннивайз сможет"
    " дотянуться до тебя\n"
    "И ты снова потеряешь 5ХР\n\n"
    "Время, отведенное на ответ, зависит от скорости "
    "твоего персонажа:",
    "Не забывай после ввода ответа нажимать ENTER\n",
    "Если ты чувствуешь в себе силы начать,"
    " мой друг, нажми ENTER и удачи!\n"
]

Level_one_congrats = [
    "Да ты молодец! Пришло время ускориться!",
    "Да ты молодец! Сейчас ты близок к выходу как никода!",
    "Да ты спортсмен, оказывается!\n"
    "Ты успешно скрылся от этого монстра! Посмотрим, что ждёт тебя дальше!"
]

Level_one_restarts = [
    "Оооо нееет!!!\n"
    "Пеннивайз вкусно пообедал. \nА ты попробуй ещё.",
    "Оооо нееет!!!\n Жизнь бывает жестока, как Пенивайз сегодня.\n"
    " А ты попробуй ещё.",
    "Оооо нееет!!!\n Победа была так близко... \n"
    "Сейчас обязательно сможешь!"
]
